УТ_для_edt/src/Documents/CRM_Телемаркетинг/CRM_Телемаркетинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Телемаркетинг</name>
  <basedOn>Catalog.МаркетинговыеМероприятия</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимодействия</name>
    <type>
      <types>CatalogRef.CRM_ВидыВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опрос</name>
    <type>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчик</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПродажи</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДозвонились</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Интерес</name>
      <type>
        <types>DocumentRef.CRM_Интерес</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеЗаказчик</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Звонок</name>
      <comment>Телефонный звонок</comment>
      <type>
        <types>DocumentRef.ТелефонныйЗвонок</types>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.CRM_ПричиныОтказовПриОбзвоне</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/CRM_Телемаркетинг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
// 
// Параметры:
//  Таблица - ТаблицаЗначений, Неопределено	- Возвращает в этом параметре подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//            Если передано Неопределено, то будет создана и заполнена новая таблица наборов значений доступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа(ЭтотОбъект, Таблица);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если (ТипЗнч(ДанныеЗаполнения)=Тип("Структура") И ДанныеЗаполнения.Свойство("МаркетинговаяКампания")) Или 
		  ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
		  
		ЗаполнитьПоМаркетинговойКампании(ДанныеЗаполнения);
		 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("СписокПартнеров") Тогда
		
		ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Партнер") Тогда
		
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Партнер",			ДанныеЗаполнения.Партнер);
		СтруктураПартнера.Вставить("КонтактноеЛицо",	ПолучитьКонтактноеЛицоКлиента(ДанныеЗаполнения.Партнер));
		СтруктураПартнера.Вставить("Интерес",			Неопределено);
		СписокПартнеров = Новый СписокЗначений;
		СписокПартнеров.Добавить(СтруктураПартнера);
		ДанныеЗаполнения.Вставить("СписокПартнеров", СписокПартнеров);
		ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
			CRM_ОбщегоНазначенияСервер.ЗаполнитьОбъектБизнесПроцесса(ЭтотОбъект, ДанныеЗаполнения);
		Иначе
			CRM_ОбщегоНазначенияСервер.ЗаполнитьОбъектБизнесПроцесса(ЭтотОбъект, ДанныеЗаполнения.БизнесПроцесс, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполним автора и ответственного.
	CRM_ОбщегоНазначенияСервер.ЗаполнитьАвтораИОтветственного(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСписокТелефонов(ТекущиеДанные, ВидКИ = Неопределено)

	Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(ТекущиеДанные.Партнер,
	?(ЗначениеЗаполнено(ТекущиеДанные.КонтактноеЛицо),ТекущиеДанные.КонтактноеЛицо,Неопределено),
	Перечисления.ТипыКонтактнойИнформации.Телефон, ВидКИ);
	
	СписокТелефонов = Новый СписокЗначений;
	
	Если НЕ Таб = Неопределено Тогда
		СписокЗнач = Новый СписокЗначений;
		
		ТекСсылка = "";
		Для Каждого СтрокаТаб Из Таб Цикл
			
			Если НЕ ТекСсылка = СтрокаТаб.Ссылка Тогда
				СтруктураНомера = Новый Структура;
				СтруктураНомера.Вставить("Представление"	, СтрокаТаб.Представление);
				СтруктураНомера.Вставить("Объект"	 , СтрокаТаб.Ссылка);
				СписокТелефонов.Добавить(СтруктураНомера, Строка(СтрокаТаб.Ссылка));
				ТекСсылка = СтрокаТаб.Ссылка;
			КонецЕсли;
			
			СтруктураНомера = Новый Структура;
			СтруктураНомера.Вставить("Представление"	, СтрокаТаб.Представление);
			СтруктураНомера.Вставить("Объект"	 , СтрокаТаб.Ссылка);
			СписокТелефонов.Добавить(СтруктураНомера, "   "+СокрЛП(СтрокаТаб.Вид) + ": " + СтрокаТаб.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокТелефонов;

КонецФункции

Функция ПолучитьКонтактноеЛицоКлиента(Клиент)
	
	Если ЗначениеЗаполнено(Клиент.CRM_ОсновноеКонтактноеЛицо) Тогда
		Возврат Клиент.CRM_ОсновноеКонтактноеЛицо;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактныеЛицаПартнеров.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Клиент);
		ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		Возврат ВыборкаИзРезультатаЗапроса.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьПоМаркетинговойКампании(ПараметрДанныеЗаполнения)

	СписокПартнеров	= Неопределено;
	Если ТипЗнч(ПараметрДанныеЗаполнения)=Тип("Структура") И ПараметрДанныеЗаполнения.Свойство("МаркетинговаяКампания") Тогда
		Если ПараметрДанныеЗаполнения.Свойство("СписокПартнеров") Тогда
		 	СписокПартнеров	= ПараметрДанныеЗаполнения.СписокПартнеров;
		КонецЕсли; 
		ДанныеЗаполнения = ПараметрДанныеЗаполнения.МаркетинговаяКампания;
	Иначе
		Если Не ТипЗнч(ПараметрДанныеЗаполнения)=Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
			Возврат;
		Иначе
			ДанныеЗаполнения = ПараметрДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;

	ДатаНачала = ДанныеЗаполнения.ДатаНачала;
	ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
	Ответственный = ДанныеЗаполнения.Ответственный;
	Проект = ДанныеЗаполнения.CRM_Проект;
	Подразделение = ДанныеЗаполнения.CRM_Подразделение;
	МаркетинговоеМероприятие = ДанныеЗаполнения;
	Тема = ДанныеЗаполнения.Наименование;
	
	тзУчастники = ДанныеЗаполнения.ПартнерыИКонтактныеЛица;
	Для Каждого стрУч Из тзУчастники Цикл
		сслПартнер = стрУч.Партнер;
		сслКонтактноеЛицо = стрУч.КонтактноеЛицо;
		спТелефоны = СформироватьСписокТелефонов(Новый Структура("Партнер, КонтактноеЛицо", сслПартнер, сслКонтактноеЛицо));
		стрУчастник = Участники.Добавить();
		стрУчастник.Партнер = сслПартнер;
		стрУчастник.КонтактноеЛицо = сслКонтактноеЛицо;
		Если спТелефоны.Количество() > 0 Тогда
			стрУчастник.Телефон = спТелефоны[0].Значение.Представление;
		КонецЕсли; 
	КонецЦикла;
	Если ЗначениеЗаполнено(СписокПартнеров) Тогда
		Для Каждого элСп Из СписокПартнеров Цикл
			стрУч = элСп.Значение;
			сслПартнер = стрУч.Партнер;
			сслКонтактноеЛицо = стрУч.КонтактноеЛицо;
			спТелефоны = СформироватьСписокТелефонов(Новый Структура("Партнер, КонтактноеЛицо", сслПартнер, сслКонтактноеЛицо));
			стрУчастник = Участники.Добавить();
			стрУчастник.Партнер = сслПартнер;
			стрУчастник.КонтактноеЛицо = сслКонтактноеЛицо;
			Если спТелефоны.Количество() > 0 Тогда
				стрУчастник.Телефон = спТелефоны[0].Значение.Представление;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения)

	СписокПартнеров =ДанныеЗаполнения.СписокПартнеров;
	мДобавленные = Новый Массив;
	Для каждого элСп Из СписокПартнеров Цикл
		элСп = элСп.Значение;
		сслПартнер = элСп.Партнер;
		сслКонтактноеЛицо = элСп.КонтактноеЛицо;
		сслИнтерес = элСп.Интерес;
		спТелефоны = СформироватьСписокТелефонов(Новый Структура("Партнер, КонтактноеЛицо",сслПартнер,сслКонтактноеЛицо));
		Если спТелефоны.Количество() > 0 Тогда
			стрТелефон = спТелефоны[0].Значение.Представление;
			бДоб = мДобавленные.Найти(стрТелефон);
			
			Если бДоб = Неопределено Тогда
			
				мДобавленные.Добавить(стрТелефон);
				стрУчастник = Участники.Добавить();
				стрУчастник.Партнер = сслПартнер;
				стрУчастник.КонтактноеЛицо = сслКонтактноеЛицо;
				стрУчастник.Интерес = сслИнтерес;
				стрУчастник.Телефон = стрТелефон;
			
			КонецЕсли; 
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
